Backend/app/controllers/api/posts_controller.rb

  def index
    post = Post.all
---
SELECT `posts`.* FROM `posts`

  def show
  	respond_with Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1

  def create
  	post = Post.new(post_params)

  	if post.save
---
INSERT INTO `posts` (`title`, `description`, `created_at`, `updated_at`) VALUES ('kmkmkm', 'dsb', '2016-10-09 05:41:14', '2016-10-09 05:41:14')

  def update
  	post = Post.find(params[:id])

  	if post.update(post_params)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 6 LIMIT 1
UPDATE `posts` SET `title` = 'hhhb', `updated_at` = '2016-10-09 05:41:29' WHERE `posts`.`id` = 7